; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v7 - type_3 ?v6 - type_1)
 	      (pred_3 ?v2 - object ?v6 - type_1)
	      (pred_1 ?v7 - type_3 ?v3 - type_2)
	      (pred_4 ?v7 - type_3 ?v2 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v7 - type_3 ?v8 ?v5 - type_1)
       :precondition (and  (pred_2 ?v7 ?v8))
       :effect (and  (pred_2 ?v7 ?v5)
		     (not (pred_2 ?v7 ?v8))))

   (:action op_2
       :parameters (?v7 - type_3 ?v4 - object ?v1 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v4 ?v1) (pred_2 ?v7 ?v1) (pred_1 ?v7 ?v3))
       :effect (and (pred_4 ?v7 ?v4 ?v3)
		    (not (pred_3 ?v4 ?v1)) 
		    (not (pred_1 ?v7 ?v3))))

   (:action op_3
       :parameters (?v7 - type_3 ?v4 - object ?v1 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v4 ?v3) (pred_2 ?v7 ?v1))
       :effect (and (pred_3 ?v4 ?v1)
		    (pred_1 ?v7 ?v3)
		    (not (pred_4 ?v7 ?v4 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_03 - type_3
obj_01 obj_06 - type_2
obj_04 obj_07 obj_09 obj_10 - type_1
obj_02 obj_05 obj_08 - object)
(:init
(pred_2 obj_03 obj_09)
(pred_1 obj_03 obj_01)
(pred_1 obj_03 obj_06)
(pred_3 obj_02 obj_04)
(pred_3 obj_05 obj_10)
(pred_3 obj_08 obj_04)
)
(:goal
(and
(pred_3 obj_02 obj_10)
(pred_3 obj_05 obj_07)
(pred_3 obj_08 obj_10)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_03 ?b obj_06))))
)
)

; plan
1. (op_1 obj_03 obj_09 obj_04)
   deleted: (pred_2 obj_03 obj_09)
   added: (pred_2 obj_03 obj_04)
   goals met: 0 of 3
2. (op_2 obj_03 obj_02 obj_04 obj_01)
   deleted: (pred_3 obj_02 obj_04) (pred_1 obj_03 obj_01)
   added: (pred_4 obj_03 obj_02 obj_01)
   goals met: 0 of 3
3. (op_1 obj_03 obj_04 obj_10)
   deleted: (pred_2 obj_03 obj_04)
   added: (pred_2 obj_03 obj_10)
   goals met: 0 of 3
4. (op_3 obj_03 obj_02 obj_10 obj_01)
   deleted: (pred_4 obj_03 obj_02 obj_01)
   added: (pred_3 obj_02 obj_10) (pred_1 obj_03 obj_01)
   goals met: 1 of 3
5. (op_2 obj_03 obj_05 obj_10 obj_01)
   deleted: (pred_3 obj_05 obj_10) (pred_1 obj_03 obj_01)
   added: (pred_4 obj_03 obj_05 obj_01)
   goals met: 1 of 3
6. (op_1 obj_03 obj_10 obj_07)
   deleted: (pred_2 obj_03 obj_10)
   added: (pred_2 obj_03 obj_07)
   goals met: 1 of 3
7. (op_3 obj_03 obj_05 obj_07 obj_01)
   deleted: (pred_4 obj_03 obj_05 obj_01)
   added: (pred_3 obj_05 obj_07) (pred_1 obj_03 obj_01)
   goals met: 2 of 3
8. (op_1 obj_03 obj_07 obj_04)
   deleted: (pred_2 obj_03 obj_07)
   added: (pred_2 obj_03 obj_04)
   goals met: 2 of 3
9. (op_2 obj_03 obj_08 obj_04 obj_01)
   deleted: (pred_3 obj_08 obj_04) (pred_1 obj_03 obj_01)
   added: (pred_4 obj_03 obj_08 obj_01)
   goals met: 2 of 3
10. (op_1 obj_03 obj_04 obj_10)
   deleted: (pred_2 obj_03 obj_04)
   added: (pred_2 obj_03 obj_10)
   goals met: 2 of 3
11. (op_3 obj_03 obj_08 obj_10 obj_01)
   deleted: (pred_4 obj_03 obj_08 obj_01)
   added: (pred_3 obj_08 obj_10) (pred_1 obj_03 obj_01)
   goals met: 3 of 3
